{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"keras_tensor_240": {"name": "keras_tensor_240:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/flatten_12_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_24_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6272"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_24_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_25_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_25_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_240", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/convolution", "op": "Conv2D", "input": ["keras_tensor_240", "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_48_1/convolution", "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/max_pooling2d_48_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_48_1/add"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_12_1/max_pooling2d_48_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_48_1/Relu", "StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-8"}, {"size": "-9"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_49_1/convolution", "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/max_pooling2d_49_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_49_1/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_12_1/max_pooling2d_49_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_49_1/Relu", "StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "-13"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_50_1/convolution", "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/max_pooling2d_50_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_50_1/add"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_12_1/max_pooling2d_50_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_50_1/Relu", "StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-16"}, {"size": "-17"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_51_1/convolution", "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/max_pooling2d_51_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_51_1/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_12_1/max_pooling2d_51_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_12_1/conv2d_51_1/Relu", "StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/flatten_12_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_12_1/flatten_12_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_24_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_12_1/flatten_12_1/Reshape", "StatefulPartitionedCall/sequential_12_1/dense_24_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-22"}, {"size": "6272"}]}, {"dim": [{"size": "6272"}, {"size": "512"}]}]}}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_24_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/dense_24_1/MatMul", "StatefulPartitionedCall/sequential_12_1/dense_24_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_24_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_12_1/dense_24_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_25_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_12_1/dense_24_1/Relu", "StatefulPartitionedCall/sequential_12_1/dense_25_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-22"}, {"size": "512"}]}, {"dim": [{"size": "512"}, {"size": "1"}]}]}}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_25_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_12_1/dense_25_1/MatMul", "StatefulPartitionedCall/sequential_12_1/dense_25_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_25_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_12_1/dense_25_1/Add"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-22"}, {"size": "1"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_12_1/dense_25_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_48_1/Reshape", "shape": [1, 1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_48_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/convolution/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_49_1/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_49_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_50_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_50_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/conv2d_51_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/batch_normalization_51_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/flatten_12_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_24_1/Cast/ReadVariableOp", "shape": [6272, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_24_1/Add/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_25_1/Cast/ReadVariableOp", "shape": [512, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_12_1/dense_25_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}